Autodesk.Revit.DB.MultipleValuesIndicationSettings.GetMultipleValuesIndicationSettings(Autodesk.Revit.DB.Document)
Returns the MultipleValuesIndicationSettings element for a given document.
Remarks:
Project documents have a MultipleValuesIndicationSettings element, one per document.
Family documents do not have MultipleValuesIndicationSettings elements.
cda:
The document for which to get the MultipleValuesIndicationSettings element.
Returns:
Returns the MultipleValuesIndicationSettings element in project documents
or null for family documents.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.MultipleValuesIndicationSettings.Value
Value to be used as multiple values indication in the document.
If Autodesk.Revit.DB.MultipleValuesIndicationSettings.Custom is true, returns Autodesk.Revit.DB.MultipleValuesIndicationSettings.CustomValue, otherwise returns a hardcoded standard value.
Since:
2022

Autodesk.Revit.DB.MultipleValuesIndicationSettings.CustomValue
Value used as multiple values indication if Autodesk.Revit.DB.MultipleValuesIndicationSettings.Custom is set to true.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.MultipleValuesIndicationSettings.Custom
If true, Autodesk.Revit.DB.MultipleValuesIndicationSettings.CustomValue is used as multiple values indication, otherwise a hardcoded standard value.
Since:
2022

Autodesk.Revit.DB.MultipleValuesIndicationSettings
MultipleValuesIndicationSettings is an element which contains project-wide settings for multiple values indication in Properties Palette and schedules.
Since:
2022